# coding: utf-8
module Nexus
  module ProgramConstant
    STATUS = {
        "0" => "新建方案",
        "1" => "人工审核未通过",
        "2" => "正在同步数据",
        "-1" => "同步失败",
        "3" => "人工审核通过",
        # "4" => "方案已经入Nexus库",
        "6" => "方案正在执行中",
        "7" => "方案暂停中",
        "8" => "方案执行结束",
        "9" => "方案执行异常"
    	}

    TYPE = {
      "target" => "主动发送",
      "model02" => "刷卡触发-模型02",
      "mid" => "刷卡触发-MID触发",
      "pos" => "刷卡触发-MID + POSID触发"
    }

    PTYPE = {
      "0" => "主动推送",
      "1" => "刷卡触发",
      "2" => "个性化",
      "3" => "自定义"
    }
  end
end