# coding: utf-8
module Nexus
  module ProgramConstant
    STATUS = {
        "0" => "待审核",
        "1" => "审核不通过",
        "2" => "待发送",
        "-1" => "同步失败",
        "3" => "审核通过",
        # "4" => "方案已经入Nexus库",
        "6" => "发送中",
        "7" => "发送暂停",
        "8" => "发送成功",
        "9" => "发送异常/终止方案"
    	}

    TYPE = {
      "target" => "主动发送",
      "model02" => "刷卡触发-模型02",
      "mid" => "刷卡触发-MID触发",
      "pos" => "刷卡触发-MID + POSID触发"
    }

    PTYPE = {
      "0" => "主动推送",
      "1" => "刷卡触发",
      "2" => "个性化",
      "3" => "自定义"
    }
  end
end